Былков_ДА_70180166/src/Catalogs/Факультеты/Факультеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Факультеты</name>
  <predefined>
    <items>
      <name>Аспирантура</name>
      <description>Аспирантура</description>
    </items>
    <items>
      <name>ИнформационныхТехнологий</name>
      <description>Информационных технологий</description>
    </items>
    <items>
      <name>КолледжФакультетСПО</name>
      <description>Колледж (факультет СПО)</description>
    </items>
    <items>
      <name>Объединенный</name>
      <description>Объединенный</description>
    </items>
    <items>
      <name>ПсихологоПедагогическогоОбразования</name>
      <description>Психолого-педагогического образования</description>
    </items>
    <items>
      <name>Управления</name>
      <description>Управления</description>
    </items>
    <items>
      <name>ЭкономикиИФинансов</name>
      <description>Экономики и финансов</description>
    </items>
    <items>
      <name>Юридический</name>
      <description>Юридический</description>
    </items>
  </predefined>
  <attributes>
    <name>Декан</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Содержание</name>
    <attributes>
      <name>Кафедра</name>
      <type>
        <types>CatalogRef.Кафедры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Былков_ДА_70180166/src/Catalogs/Факультеты/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ЗаполнитьКафедрыФакультетаНаСервере()

    // Очищаем табличную часть перед заполнением
    Объект.Содержание.Очистить();

    // Если факультет новый или не имеет наименования - выходим
    Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
        Возврат;
    КонецЕсли;

    // Создаем запрос для выборки кафедр
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Кафедры.Ссылка КАК Кафедра,
    |   Кафедры.Наименование КАК НаименованиеКафедры
    |ИЗ
    |   Справочник.Кафедры КАК Кафедры
    |ГДЕ
    |   Кафедры.ЭтоГруппа = Ложь
    |   И Кафедры.Родитель.Наименование = &НаименованиеФакультета";

    // Устанавливаем параметр запроса
    Запрос.УстановитьПараметр("НаименованиеФакультета", Объект.Наименование);

    // Выполняем запрос
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

    // Заполняем табличную часть "Содержание"
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Объект.Содержание.Добавить();
        НоваяСтрока.Кафедра = Выборка.Кафедра;
    КонецЦикла;

КонецПроцедуры     

&НаКлиенте
Процедура ЗаполнитьКафедры()
    // Вызываем серверный метод для заполнения кафедр
    ЗаполнитьКафедрыФакультетаНаСервере();
КонецПроцедуры      


&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
    // Если наименование изменилось - обновляем список кафедр
    Если ЗначениеЗаполнено(Объект.Наименование) Тогда
        ЗаполнитьКафедры();
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
    // Проверка уникальности факультета
    ПроверитьУникальностьФакультета(Отказ, Объект.Наименование, Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ПроверитьУникальностьФакультета(Отказ, Наименование, Ссылка)

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Факультеты.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.Факультеты КАК Факультеты
    |ГДЕ
    |   Факультеты.Наименование = &Наименование
    |   И Факультеты.Ссылка <> &Ссылка";

    Запрос.УстановитьПараметр("Наименование", Наименование);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);

    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();

     РезультатЗапроса = Запрос.Выполнить();

    Если НЕ РезультатЗапроса.Пустой() Тогда
        Сообщить("Такой факультет уже существует в системе!");
        Отказ = Истина;
    КонецЕсли;


КонецПроцедуры
